#include <stdio.h>

int main () {

    while (1) { /*Нескінченний цикл для повторного запуску коду*/
    int t; // Змінна для вибору завдання
    printf ("Choose task:\n 1.Aditional_1 task_8\n 2.Aditional_2 task_3\n"); // Виведення тексту для вибору завдання
    scanf ("%d", &t); // Зчитування вибраного завдання з клавіатури

if (t==1) { /*Завдання 1*/
    
    int n, m; // Змінні розміру масивів
    
    printf("Enter size for Massive_A: \n"); // Виведення тексту для вводу розміру масиву А
    scanf("%d", &n); // Зчитування введеного значення

    printf("Enter size for Massive_B: \n"); // Виведення тексту для вводу розміру масиву В
    scanf("%d", &m); // Зчитування введеного значення
    
    float Massive_A[n], Massive_B[m], Massive_C[n + m]; // Змінні масивів 

    printf ("Enter the Massive_A elements:\n"); // Виведення тексту для вводу елементів масиву А
    for (int i = 0; i < n; i++) { // Цикл для ініціалізації значень елементів масиву А
        scanf("%f", &Massive_A[i]); // Зчитування введених елементів
        Massive_C[i] = Massive_A[i]; // Перенесення елементів масиву А в масив С, починаючи з 0 елемента
    }

    printf ("Enter the Massive_B elements:\n"); // Виведення тексту для вводу елементів масиву В
    for (int j = 0; j < m; j++) { // Цикл для ініціалізації значень елементів масиву В
        scanf("%f", &Massive_B[j]); // Зчитування введених елементів
        Massive_C[n + j] = Massive_B[j]; // Перенесення елементів масиву А в масив С, починаючи з n елемента
    }

    printf("The Massive_C:\n"); // Виведення тексту Масив С:
    for (int k = 0; k < n + m; k++) { // Цикл для виведення значень елементів масиву С
        printf("%f ", Massive_C[k]); // Виведення усіх елементів масиву С
    }
}

if (t==2) { /*Завдання 2*/
    
    int rows, cols; // Змінні розміру рядків та стовпців матриці

    printf("Enter size of rows: "); // Виведення тексту для вводу розміру рядків
    scanf("%d", &rows); // Зчитування введеного значення

    printf("Enter size of columns: "); // Виведення тексту для вводу розміру стовпців
    scanf("%d", &cols); // Зчитування введеного значення

    int matrix[rows][cols]; // Змінна матриця

    printf("Enter the elements of the matrix:\n"); // Виведення тексту для вводу елементів матриці
    for (int i = 0; i < rows; i++) { // Цикл для ініціалізації елементів рядків матриці 
        for (int j = 0; j < cols; j++) { // Цикл для ініціалізації елементів стовпців матриці 
            printf("Matrix[%d][%d]: ", i, j); // Виведення підказки, який елемент треба заповнити
            scanf("%d", &matrix[i][j]); // Зчитування введених значень
        }
    }

    int minCol = 0, maxCol = 0; // Змінні для мінімального й максимального стовпчика
    int min = matrix[0][0]; // Змінна мінімального матриці-стовпчика
    int max = matrix[0][0]; // Змінна максимального матриці-стовпчика

    for (int j = 0; j < cols; j++) { // Цикл для знаходження мінімального стовпчика за допомогою елементів стовпців
        for (int i = 0; i < rows; i++) { // Цикл для знаходження мінімального стовпчика за допомогою елементів рядків
            if (matrix[i][j] < min) { // Умова для знаходження мінімальної матриці-стовпчика
                min = matrix[i][j]; // Ініціалізація мінімальної матриці-стовпчика
                minCol = j; 
            }

            if (matrix[i][j] >= max) { // Умова для знаходження максимальної матриці-стовпчика
                max = matrix[i][j]; // Ініціалізація максимальної матриці-стовпчика
                maxCol = j; 
            }
        }
    }

    printf("\nOriginal Matrix:\n"); // Виведення тексту Оригінальна матриця
    for (int i = 0; i < rows; i++) { // Цикл для ініціалізація елементів рядків матриці
        for (int j = 0; j < cols; j++) { // Цикл для ініціалізація елементів стовпчиків матриці
            printf("%d\t", matrix[i][j]); // Виведення матриці
        }
        printf("\n"); // Виведення відступу
    }

    for (int i = 0; i < rows; i++) { // Цикл для змінни стовпців місцями
        int temp = matrix[i][minCol];
        matrix[i][minCol] = matrix[i][maxCol];
        matrix[i][maxCol] = temp;
    }

    printf("\nMatrix after swapping columns with min and max elements:\n"); // Виведення тексту Матриця після змін
    for (int i = 0; i < rows; i++) { // Цикл для ініціалізація елементів рядків матриці
        for (int j = 0; j < cols; j++) { // Цикл для ініціалізація елементів стовпчиків матриці
            printf("%d\t", matrix[i][j]); // Виведення матриці
        }
        printf("\n"); // Виведення відступу
    }

    }
    
}
}